In [17]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
from csv import writer

In [4]:
url = "https://www.pararius.com/apartments/amsterdam"

In [5]:
page = requests.get(url)

In [6]:
soup = BeautifulSoup(page.content, 'html.parser')

In [9]:
#print (soup)

In [10]:
lists = soup.find_all('section', class_ = "listing-search-item")

In [12]:
#lists

In [20]:
with open('housing.csv','w',encoding='utf8', newline='') as f:
    thewriter = writer(f)
    header = ['Title', 'Location','Price','Area','Number_of_rooms']
    thewriter.writerow(header)
    for list in lists:
        title = list.find('a', class_ = "listing-search-item__link--title").text.replace('\n', '')
        location = list.find('div', class_ = "listing-search-item__sub-title").text.replace('\n', '')
        price = list.find('div', class_ = "listing-search-item__price").text.replace('\n', '')
        area = list.find('li', class_ = "illustrated-features__item illustrated-features__item--surface-area").text.replace('\n', '')
        number_of_rooms = list.find('li', class_ = "illustrated-features__item illustrated-features__item--number-of-rooms").text.replace('\n', '')
    
        info = [title, location,price,area, number_of_rooms]
        thewriter.writerow(info)

# Webscraping Jumia phones

In [63]:
jumia = "https://www.jumia.com.ng/mobile-phones/"

In [64]:
webpage = requests.get(jumia)

In [65]:
webpage

In [66]:
soup = BeautifulSoup(webpage.content, 'html.parser')

In [68]:
#soup

In [114]:
temps = soup.find_all('section', class_ = "card -fh")

In [121]:
#temps

In [126]:
links = temp.find_all('div',class_ = "info")

In [132]:

with open('phone_price.csv','w', encoding='utf8', newline='')as f:
    thewriter = writer(f)
    header = ['Name','Price']
    thewriter.writerow(header)
    for info in links:
        name = info.find('h3',class_ ="name").text
        price = info.find('div',class_ ="prc").text
        #rating = info.find('div', class_ ="stars _s").text
        data = [name,price]
        thewriter.writerow(data)

# Clean the housing data

In [133]:
housing = pd.read_csv("housing.csv")
housing.head()

,Title,Location,Price,Area,Number_of_rooms
0,Apartment Keizersgrach...,1016 EG Amsterdam (Grachtengordel-...,"€6,000 per month",270 m²,4 rooms
1,Apartment Reguliersgra...,1017 LV Amsterdam (Grachtengordel-...,"€5,500 per month",141 m²,4 rooms
2,Apartment Christiaan d...,1091 NG Amsterdam (Transvaalbuurt)...,"€1,950 per month",50 m²,3 rooms
3,Apartment Pieter Corne...,1071 BN Amsterdam (Museumkwartier)...,"€2,850 per month",131 m²,4 rooms
4,Apartment Van Nijenrod...,1082 JE Amsterdam (Buitenveldert-W...,"€1,950 per month",40 m²,2 rooms

In [135]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Title            32 non-null     object
 1   Location         32 non-null     object
 2   Price            32 non-null     object
 3   Area             32 non-null     object
 4   Number_of_rooms  32 non-null     object
dtypes: object(5)
memory usage: 1.4+ KB

In [142]:
# clean the data
import re
def clean(data):
    return re.sub("[^0-9]", "", data)

In [143]:
housing['Prices'] = housing['Price'].apply(clean)

In [144]:
housing['Area_sqrm'] = housing["Area"].apply(clean)
housing['Number_of_Rooms']= housing['Number_of_rooms'].apply(clean)

In [145]:
housing.head()

,Title,Location,Price,Area,Number_of_rooms,Prices,Area_sqrm,Number_of_Rooms
0,Apartment Keizersgrach...,1016 EG Amsterdam (Grachtengordel-...,"€6,000 per month",270 m²,4 rooms,6000,270,4
1,Apartment Reguliersgra...,1017 LV Amsterdam (Grachtengordel-...,"€5,500 per month",141 m²,4 rooms,5500,141,4
2,Apartment Christiaan d...,1091 NG Amsterdam (Transvaalbuurt)...,"€1,950 per month",50 m²,3 rooms,1950,50,3
3,Apartment Pieter Corne...,1071 BN Amsterdam (Museumkwartier)...,"€2,850 per month",131 m²,4 rooms,2850,131,4
4,Apartment Van Nijenrod...,1082 JE Amsterdam (Buitenveldert-W...,"€1,950 per month",40 m²,2 rooms,1950,40,2

In [147]:
housing_data = housing.drop(['Price','Area','Number_of_rooms'],axis=1, inplace=True)
housing_data

In [149]:
housing.head()

,Title,Location,Prices,Area_sqrm,Number_of_Rooms
0,Apartment Keizersgrach...,1016 EG Amsterdam (Grachtengordel-...,6000,270,4
1,Apartment Reguliersgra...,1017 LV Amsterdam (Grachtengordel-...,5500,141,4
2,Apartment Christiaan d...,1091 NG Amsterdam (Transvaalbuurt)...,1950,50,3
3,Apartment Pieter Corne...,1071 BN Amsterdam (Museumkwartier)...,2850,131,4
4,Apartment Van Nijenrod...,1082 JE Amsterdam (Buitenveldert-W...,1950,40,2

In [151]:
housing['Prices'] = housing['Prices'].astype('int')
housing['Area_sqrm'] = housing['Area_sqrm'].astype('int')
housing['Number_of_Rooms'] = housing['Number_of_Rooms'].astype('int')

In [152]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Title            32 non-null     object
 1   Location         32 non-null     object
 2   Prices           32 non-null     int32
 3   Area_sqrm        32 non-null     int32
 4   Number_of_Rooms  32 non-null     int32
dtypes: int32(3), object(2)
memory usage: 1.0+ KB

In [154]:
housing['Location'][5]

'            1017 DT Amsterdam (Grachtengordel-Zuid)        '

In [159]:
def clean_location(location):
    return re.sub("[^a-zA-Z0-9 ]", " ", location)

In [160]:
housing['Location']= housing['Location'].apply(clean_location)

In [164]:
#Top apartments with high price
housing[['Title','Prices']].sort_values(by='Prices', ascending=False)[:5]

                                                Title  Prices
0                           Apartment Keizersgrach...    6000
1                           Apartment Reguliersgra...    5500
5                           House Keizersgracht   ...    5250
6                           Apartment Bilderdijkst...    3600
13                          Apartment Van Tuyll va...    3375

In [165]:
housing.to_csv('housing_data.csv')

# Prepare the housing dataset for machine learning

In [166]:
# Lets change the categorical data to numerical
housing['Location_code'] = housing['Location'].astype("category").cat.codes

In [167]:
housing.head()

,Title,Location,Prices,Area_sqrm,Number_of_Rooms,Location_code
0,Apartment Keizersgrach...,1016 EG Amsterdam GrachtengordelWe...,6000,270,4,6
1,Apartment Reguliersgra...,1017 LV Amsterdam GrachtengordelZu...,5500,141,4,12
2,Apartment Christiaan d...,1091 NG Amsterdam Transvaalbuurt ...,1950,50,3,26
3,Apartment Pieter Corne...,1071 BN Amsterdam Museumkwartier ...,2850,131,4,16
4,Apartment Van Nijenrod...,1082 JE Amsterdam BuitenveldertWes...,1950,40,2,20

In [168]:
#chech relationship between variables
corr = housing.corr()
corr

                   Prices  Area_sqrm  Number_of_Rooms  Location_code
Prices           1.000000   0.885582         0.634050      -0.168542
Area_sqrm        0.885582   1.000000         0.688762      -0.039962
Number_of_Rooms  0.634050   0.688762         1.000000       0.158400
Location_code   -0.168542  -0.039962         0.158400       1.000000

In [169]:
#import libraries for machine learning and visualization

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [170]:
# set feature and target dataset
x = housing[['Area_sqrm','Number_of_Rooms','Location_code']]
y= housing[['Prices']]

In [171]:
x.shape

(32, 3)

In [172]:
y.shape

(32, 1)

In [173]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.3,random_state=2)

In [174]:
x_train.shape

(22, 3)

In [175]:
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(10, 3)
(22, 1)
(10, 1)

In [176]:
lr = LinearRegression()

In [177]:
lr.fit(x_train,y_train)

LinearRegression()

In [178]:
y_pred = lr.predict(x_test)

In [179]:
y_pred

array([[1854.90069868],
       [5328.45242582],
       [2178.00321631],
       [1393.65207588],
       [2149.06679375],
       [2262.91438212],
       [3436.93865077],
       [2560.96468986],
       [3379.15344377],
       [1288.23896783]])

In [181]:
score = lr.score(x_test,y_test)

In [183]:
score*100

76.79255445312072

In [184]:
y_test

    Prices
20    1850
0     6000
23    2000
12    1950
29    1900
9     2250
1     5500
21    2400
14    2795
16    1195